# IdeaStatiCa.ConnectionApi.Model.ConWorkPlaneOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Method** | **ConWorkPlaneMethod** |  | [optional]
**RelatedTo** | **ConWorkPlaneRelatedTo** |  | [optional]
**Origin** | **Point3D** |  | [optional]
**NormalVector** | **Vector3D** |  | [optional]
**RotationX** | **double** |  | [optional]
**RotationY** | **double** |  | [optional]
**RotationZ** | **double** |  | [optional]
**IsFatigue** | **bool** |  | [optional]
**MemberId** | **int?** |  | [optional]
**PlateId** | **int?** |  | [optional]
**PlateOperationId** | **int?** |  | [optional]
**RelatedMemberId** | **int?** |  | [optional]
**OffsetX** | **double** |  | [optional]
**NearIntersection** | **bool** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)